src/main/resources/xml/usZipSoap/getInfoByCity/getInfoByCity.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"	xmlns:web="http://www.webserviceX.NET">
	<soap:Header />
	<soap:Body>
		<web:GetInfoByCity>
			<web:USCity>Greensboro</web:USCity>
		</web:GetInfoByCity>
	</soap:Body>
</soap:Envelope> 
